from datetime import date

# current_date = date.today().strftime('%A %d %B %Y')
current_date = 'Saturday 24 June 2023'


def sidebar(request):
    request['tasks'] = [
        {
            'task_head': 'Реализовать',
            'current_date': current_date,
            'task_body': 'Реализовать создание студента (регистрация). Список студентов. Запись студента на курс.',
            'mark': False,
        },
        {
            'task_head': 'Создать страницу для изменения курса',
            'current_date': current_date,
            'task_body': 'Создать страницу для изменения курса. После изменения отправлять уведомления всем'
                         ' студентам на курсе по sms, email (для имитации можно просто выводить сообщения в консоль). '
                         'Также известно, что в будущем способов уведомления будет больше. '
                         'Добавить возможность применять цикл for к объекту категории курса '
                         '(в каждой итерации получаем курс) и объекта курса (в каждой итерации получаем студента). '
                         'Например for student in course: … for course in group',
            'mark': False,
        },
        {
            'task_head': 'Создать api для курсов',
            'current_date': current_date,
            'task_body': 'Создать api для курсов. По определенному адресу выводить не веб-страницу, '
                         'а отдавать пользователю данные о списке курсов в формате json',
            'mark': False,
        },
        {
            'task_head': 'Улучшить логгер',
            'current_date': current_date,
            'task_body': 'Улучшить логгер (или добавить если его нет). Добавить в логгер возможность писать в файл, '
                         'в консоль. Также известно что в будущем вариантов сохранения может быть еще больше',
            'mark': True,
        },
        {
            'task_head': 'Реализовать CBV',
            'current_date': current_date,
            'task_body': 'Реализовать CBV (Class Based VIews). Возможность создавать view в виде класса '
                         '(по аналогии с Django). И убрать таким образом часть дублирования во view',
            'mark': False,
        },
    ]


tasks = [sidebar]
